PHP_TEAM/app/Http/Controllers/Front/IndexController.php

    public function index()
    {

        // todo: 商品詳細テーブル(items)のデータを取得し、8件ユーザTOP画面に表示させるための処理。
         $this->data['items'] = ProductModel::limit(8)->get();
---
select * from `items` limit 8