PHP_TEAM/app/Http/Controllers/Front/UserController.php

    public function info()
    {
        $points = PointModel::where('user_id', Auth::user()->id)->get();
---
select * from `points` where `user_id` = 9